#ifndef _GAMEMODE_H
#define _GAMEMODE_H

//=====================================================================================================================================
// 
//=====================================================================================================================================

//どのゲームをするか選ぶための関数
int SelectMenu();


typedef struct
{
	int SelX, SelY;
	char name[128];
}MenuElement;


//遊び方を表示するための関数
void HowPlay();

//対人戦をするための関数
void VSFriendGame();

//AI戦をするための関数
void VSNPCGame();




#endif // !_GAMEMODE_H
